In [22]:
# import libraries
import pandas as pd
import numpy as np

In [23]:
data1 = { 'id':[1,2,3], 'name':['Bilal', 'Ali', 'Naeem'], 'age': [26,23,25]}
df1 = pd.DataFrame(data1)
df1.head()

   id   name  age
0   1  Bilal   26
1   2    Ali   23
2   3  Naeem   25

In [24]:
data2 = {'id':[1,2,3,4,5], 'city':['Lahore', 'Karachi', 'Islamabad', 'Peshawar', 'Quetta'], 'Ocupation':['Pilot','Doct','Engineer','Businessman','Teacher']}
df2 = pd.DataFrame(data2)
df2.head()

   id       city    Ocupation
0   1     Lahore        Pilot
1   2    Karachi         Doct
2   3  Islamabad     Engineer
3   4   Peshawar  Businessman
4   5     Quetta      Teacher

In [25]:
# Merging DataFrames on 'id'
merged_df = pd.merge(df1, df2, on='id', how='inner')
merged_df = pd.merge(df1, df2, on='id', how='outer')
merged_df = pd.merge(df1, df2, on='id', how='left')
merged_df = pd.merge(df1, df2, on='id', how='right')
merged_df.head()

   id   name   age       city    Ocupation
0   1  Bilal  26.0     Lahore        Pilot
1   2    Ali  23.0    Karachi         Doct
2   3  Naeem  25.0  Islamabad     Engineer
3   4    NaN   NaN   Peshawar  Businessman
4   5    NaN   NaN     Quetta      Teacher

# Concatenation

In [26]:
# Dataset 1 - Pakistani Names and Ages
data1 = {'Name': ['Ahmed', 'Fatima', 'Ali'], 'Age': [28, 32, 24]}
# Dataset 2 - More Pakistani Names and Ages
data2 = {'Name': ['Sara', 'Usman', 'Aisha'], 'Age': [29, 35, 27]}
# Dataset 3 - Cities and Provinces in Pakistan
data3 = {'City': ['Karachi', 'Lahore', 'Islamabad'], 'Province': ['Sindh', 'Punjab', 'Islamabad']}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

In [27]:
# Concatenating Rows
concatenated_rows = pd.concat([df1, df2])

# Concatenating Columns
# Note: For a meaningful column-wise concatenation, dataframes should have the same number of rows.
concatenated_columns = pd.concat([df1, df3], axis=1)
print(concatenated_rows)
print(";;;;;;;;;;;;;;;;;;;;;;;;;;;;;;")
concatenated_columns

     Name  Age
0   Ahmed   28
1  Fatima   32
2     Ali   24
0    Sara   29
1   Usman   35
2   Aisha   27
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

     Name  Age       City   Province
0   Ahmed   28    Karachi      Sindh
1  Fatima   32     Lahore     Punjab
2     Ali   24  Islamabad  Islamabad